# Pandas

## Pandas Serisi Oluşturma

In [1]:
import pandas as pd  
import numpy as np

In [2]:
seri = pd.Series([80,45,23,57])

In [3]:
seri

0    80
1    45
2    23
3    57
dtype: int64

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes        # serinin index bilgisine ulaşırız. (seri.index)

[RangeIndex(start=0, stop=4, step=1)]

In [6]:
seri.keys

<bound method Series.keys of 0    80
1    45
2    23
3    57
dtype: int64>

In [7]:
list(seri.items())

[(0, 80), (1, 45), (2, 23), (3, 57)]

In [8]:
seri.values

array([80, 45, 23, 57], dtype=int64)

In [9]:
seri.head()      # serinin ilk 5 gözlemini getirir.   head(3) : ilk 3 gözlemini getirir.

0    80
1    45
2    23
3    57
dtype: int64

In [10]:
seri.tail()     # serinin sondan ilk 5 gözlemini gösterir.  tail(2) : sondan ilk 2 gözlem

0    80
1    45
2    23
3    57
dtype: int64

#### index isimlendirme

In [11]:
seri = pd.Series([46,76,23,78],index = [1,3,5,7])     
seri

1    46
3    76
5    23
7    78
dtype: int64

In [12]:
seri[3]

76

In [13]:
seri[2:4]      # indexe göre seçim yapar

5    23
7    78
dtype: int64

In [14]:
seri = pd.Series([99,22,332,94,5],index = ["f","d","a","t","r"])
seri

f     99
d     22
a    332
t     94
r      5
dtype: int64

In [15]:
seri["d"]

22

In [16]:
seri["f":"t"]

f     99
d     22
a    332
t     94
dtype: int64

In [17]:
"d" in seri        # index ile eleman sorgulama

True

In [18]:
seri[["f","t"]]    # fancy index ile eleman seçme

f    99
t    94
dtype: int64

#### sozluk üzerinden seri oluşturma

In [19]:
seri = pd.Series({"a1":10,"a2":11})

In [20]:
seri

a1    10
a2    11
dtype: int64

In [21]:
seri["a1"]

10

In [22]:
pd.concat([seri,seri])     # iki seriyi birleştirerek seri oluşur.

a1    10
a2    11
a1    10
a2    11
dtype: int64

## Pandas DataFrame Oluşturma

In [23]:
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [24]:
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [25]:
df["var1"]

0    1
1    4
2    7
Name: var1, dtype: int32

In [26]:
"var1" in df

True

In [27]:
df.columns       # sütun degişkenlerin isimlerini getirir.

Index(['var1', 'var2', 'var3'], dtype='object')

In [28]:
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [29]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [30]:
df.size      # eleman sayısı

9

In [31]:
df.ndim      # boyut bilgisi

2

In [32]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## Pandas DataFrame icin Eleman İslemleri

In [33]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [34]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [35]:
sozluk

{'var1': array([8, 7, 8, 9, 4]),
 'var2': array([8, 4, 3, 4, 9]),
 'var3': array([2, 7, 5, 4, 2])}

In [36]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     8     2
1     7     4     7
2     8     3     5
3     9     4     4
4     4     9     2

In [37]:
df[1:4]

   var1  var2  var3
1     7     4     7
2     8     3     5
3     9     4     4

In [38]:
df.index = ["a","b","c","d","e"]

In [39]:
df

   var1  var2  var3
a     8     8     2
b     7     4     7
c     8     3     5
d     9     4     4
e     4     9     2

In [40]:
df["a":"d"]

   var1  var2  var3
a     8     8     2
b     7     4     7
c     8     3     5
d     9     4     4

## Satır Silme

In [41]:
df.drop("b",axis=0, inplace=True)      # axis=0 satıra göre silme yapar,inplace=True işlemin kalıcı olmasını sağlar.

In [42]:
df

   var1  var2  var3
a     8     8     2
c     8     3     5
d     9     4     4
e     4     9     2

In [43]:
l=["a","e"]                # fancy ile satır silme
df.drop(l,axis=0)

   var1  var2  var3
c     8     3     5
d     9     4     4

## Sütun Silme (Değişken)

In [44]:
df

   var1  var2  var3
a     8     8     2
c     8     3     5
d     9     4     4
e     4     9     2

In [45]:
df.drop("var3",axis=1, inplace = True)

In [46]:
df

   var1  var2
a     8     8
c     8     3
d     9     4
e     4     9

In [47]:
l = ["var1"]           # fancy ile sütun silme
df.drop(l,axis=1)

   var2
a     8
c     3
d     4
e     9

## Gözlem ve Degişken Seçimi : loc & iloc

In [48]:
m = np.random.randint(1,30,size=(5,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    13     8     7
1     4    22    17
2    21    11    15
3    18    16    21
4    28    17    21

In [49]:
df.loc[0:3]          # loc : tanımlandığı şekli ile indexleme yapar.

   var1  var2  var3
0    13     8     7
1     4    22    17
2    21    11    15
3    18    16    21

In [50]:
df.iloc[0:3]         # iloc : alışık olduğumuz indexleme mantığı ile

   var1  var2  var3
0    13     8     7
1     4    22    17
2    21    11    15

In [51]:
df.iloc[2,2]

15

In [52]:
df.iloc[:3,:2]

   var1  var2
0    13     8
1     4    22
2    21    11

In [53]:
df.loc[0:3,"var3"]

0     7
1    17
2    15
3    21
Name: var3, dtype: int32

In [54]:
df.iloc[0:3]["var3"]

0     7
1    17
2    15
Name: var3, dtype: int32

## Koşullu Eleman İşlemleri

In [55]:
m = np.random.randint(1,30,size=(5,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     8    20    20
1    27    24    15
2    17    19    13
3     9    25    16
4     2    28    19

In [56]:
df["var1"][0:4]

0     8
1    27
2    17
3     9
Name: var1, dtype: int32

In [57]:
df[0:2][["var1","var2"]]       # fancy ile

   var1  var2
0     8    20
1    27    24

In [58]:
df > 10

    var1  var2  var3
0  False  True  True
1   True  True  True
2   True  True  True
3  False  True  True
4  False  True  True

In [59]:
df[df > 10]

   var1  var2  var3
0   NaN    20    20
1  27.0    24    15
2  17.0    19    13
3   NaN    25    16
4   NaN    28    19

In [60]:
df[df.var1 > 10]

   var1  var2  var3
1    27    24    15
2    17    19    13

In [61]:
df[(df.var1 > 10) & (df.var3 < 20)]

   var1  var2  var3
1    27    24    15
2    17    19    13

In [62]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
1    27    24
2    17    19

In [63]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    27    24
2    17    19

## Birleştirme(Join) İşlemleri

In [64]:
m = np.random.randint(1,30,size=(4,3))
df1 = pd.DataFrame(m,columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0     1    19    19
1     6     2    12
2    23     7    18
3    29    13     2

In [65]:
df2 = df1 + 90        # tum degerlere 90 eklendi
df2

   var1  var2  var3
0    91   109   109
1    96    92   102
2   113    97   108
3   119   103    92

In [66]:
pd.concat([df1,df2], ignore_index = True)     
# birleştirme yapınca index sırasının düzenli olması için ignore_index = True  olmalı.

   var1  var2  var3
0     1    19    19
1     6     2    12
2    23     7    18
3    29    13     2
4    91   109   109
5    96    92   102
6   113    97   108
7   119   103    92

In [67]:
df2.columns = ["var1","var2","deg3"]      # degişken ismi degiştirme 
df2

   var1  var2  deg3
0    91   109   109
1    96    92   102
2   113    97   108
3   119   103    92

In [68]:
df1

   var1  var2  var3
0     1    19    19
1     6     2    12
2    23     7    18
3    29    13     2

In [69]:
pd.concat([df1,df2],ignore_index = True)

   var1  var2  var3   deg3
0     1    19  19.0    NaN
1     6     2  12.0    NaN
2    23     7  18.0    NaN
3    29    13   2.0    NaN
4    91   109   NaN  109.0
5    96    92   NaN  102.0
6   113    97   NaN  108.0
7   119   103   NaN   92.0

In [70]:
pd.concat([df1,df2] , join = "inner",ignore_index = True)      # kesişimlerine göre birleştirme yaptı.

   var1  var2
0     1    19
1     6     2
2    23     7
3    29    13
4    91   109
5    96    92
6   113    97
7   119   103

## İleri Birleştirme İşlemleri

In [71]:
df1 = pd.DataFrame({"calisanlar":["ali","veli","ayse","fatma"] ,
                    "grup" : ["muhasebe","muhendislik","muhendislik","ik"]})
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [72]:
df2 = pd.DataFrame({"calisanlar":["ayse","ali","veli","fatma"] ,
                    "ilk_giris" : [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      fatma       2019

In [73]:
pd.merge(df1,df2)       # çalışanlar ikisinde de olduğu için birleştirme ona göre yapılır.
                        # pd.merge(df1,df2, on = "calisanlar")  ile birleştirmenin neye göre yapılacağını söyleriz.

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

#### çoktan teke

In [74]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

In [75]:
df4 = pd.DataFrame({"grup" : ["muhasebe","muhendislik","ik"],
                    "mudur" : ["caner","mustafa","berkcan"] })
df4

          grup    mudur
0     muhasebe    caner
1  muhendislik  mustafa
2           ik  berkcan

In [76]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        ali     muhasebe       2009    caner
1       veli  muhendislik       2014  mustafa
2       ayse  muhendislik       2010  mustafa
3      fatma           ik       2019  berkcan

#### çoktan çoka

In [77]:
df5 = pd.DataFrame({"grup" : ["muhasebe","muhasebe","muhendislik","muhendislik","ik","ik"],
                    "yetenekler" : ["matematik","excel","kodlama","linux","excel","yonetim"] })
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           ik      excel
5           ik    yonetim

In [78]:
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [79]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        ali     muhasebe  matematik
1        ali     muhasebe      excel
2       veli  muhendislik    kodlama
3       veli  muhendislik      linux
4       ayse  muhendislik    kodlama
5       ayse  muhendislik      linux
6      fatma           ik      excel
7      fatma           ik    yonetim

## Toplulaştırma ve Gruplama (Aggregation & Grouping)

* Basit Toplulaştırma Fonksiyonları : 
* count()  
* first()  
* last()  
* mean()  
* median()   
* min()    
* max()   
* std()   
* var()
* sum()

In [80]:
import seaborn as sns

In [81]:
df = sns.load_dataset("planets")      # seaborn içindeki veri seti
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [82]:
df.shape       # 1035 gözlem(satır) ve 6 değişkenden oluşur.

(1035, 6)

In [83]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [84]:
df["mass"].mean()     # belirli bir değişkene göre ortalamasını hesaplar.

2.6381605847953216

In [85]:
df.describe().T       # veri setindeki sayısal değişkenlerin özelliklerini hesaplar.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [86]:
df.dropna().describe().T     # veri setindeki eksik verileri(NaN) olan satırları silip ona göre hesaplama yapar.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

### Gruplama İşlemleri(Grouping)

gruplama işlemleri için kategorik değişken lazım.

In [87]:
df = pd.DataFrame({"gruplar" : ["A","B","C","A","B","C"],
                  "veri" : [10,11,52,23,43,55]} , columns = ["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [88]:
df.groupby("gruplar")

In [89]:
df.groupby("gruplar").mean()     # "gruplar" değişkenine göre gruplandırma yapıp her birinin ortalamasını alır.

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [90]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [91]:
df = sns.load_dataset("planets")   
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [92]:
df.groupby("method")["orbital_period"].mean()   # method sınıflarına göre gruplama yaptı,her birinin "orbital_period" değişkenine karşılık gelen değerlerinin ortalamasını aldı.

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [93]:
df.groupby("method")["orbital_period"].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

## İleri Toplulaştırma İşlemleri(Aggregate,filter,transform,apply)

In [94]:
df = pd.DataFrame({"gruplar" : ["a","b","c","a","b","c"],
                  "degisken1" : [10,23,33,22,11,99],
                  "degisken2" : [100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

#### aggregate

In [95]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
a             16.0      181.0
b             17.0      182.0
c             66.0      651.0

In [96]:
df.groupby("gruplar").aggregate(["min",np.median,max])    # aggregate ile istediğimiz fonksiyonları kullanabiliriz.

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10   16.0  22       100  181.0  262
b              11   17.0  23       111  182.0  253
c              33   66.0  99       333  651.0  969

In [97]:
df.groupby("gruplar").aggregate({"degisken1" : min ,     # her degişkene farklı hesaplamalar yapmak için 
                                "degisken2" : max})

         degisken1  degisken2
gruplar
a               10        262
b               11        253
c               33        969

#### filter

kendi tanımladığımız fonksiyonları filtreleme aracı olrk değişkenler üzerinde sorgulamak için kullanılır.

In [98]:
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [99]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [100]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

In [101]:
df.groupby("gruplar").filter(filter_func)   # std > 9 olanların değerlerini getirdi.

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969

#### transform

Değişkenler üzerinde işlem,dönüşüm yapmak için kullanılır.

In [102]:
df = pd.DataFrame({"gruplar" : ["a","b","c","a","b","c"],
                  "degisken1" : [10,23,33,22,11,99],
                  "degisken2" : [100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [103]:
df_a = df.iloc[:,1:3]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [104]:
df_a.transform(lambda x:x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [105]:
df_a.transform(lambda x: (x-x.mean()) / x.std() )

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

#### apply

In [107]:
df = pd.DataFrame({"degisken1" : [10,23,33,22,11,99],
                  "degisken2" : [100,253,333,262,111,969]},
                  columns = ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [108]:
df.sum()

degisken1     198
degisken2    2028
dtype: int64

In [109]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [110]:
df = pd.DataFrame({"gruplar" : ["a","b","c","a","b","c"],
                  "degisken1" : [10,23,33,22,11,99],
                  "degisken2" : [100,253,333,262,111,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [111]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
a            aa         32        362
b            bb         34        364
c            cc        132       1302

In [112]:
df.groupby("gruplar").sum()

         degisken1  degisken2
gruplar
a               32        362
b               34        364
c              132       1302

## Dış Kaynaklı Veri Okuma

In [113]:
# csv okuma
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [114]:
pd.read_csv("reading_data/ornekcsv.csv" , sep = ";")   # sep=";" ile ön tanımlı değeri ";" yaparız ve okuma işlemi hatasız olur.

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [115]:
# txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [116]:
# excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0